# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [2]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

In [3]:
baby_names = pd.read_csv(url)

### Step 3. Assign it to a variable called baby_names.

In [4]:
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 42.6+ MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
Unnamed: 0    1016395 non-null int64
Id            1016395 non-null int64
Name          1016395 non-null object
Year          1016395 non-null int64
Gender        1016395 non-null object
State         1016395 non-null object
Count         1016395 non-null int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Step 4. See the first 10 entries

In [5]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
baby_names = baby_names.drop(columns=['Unnamed: 0', 'Id'])

In [7]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Are there more male or female names in the dataset?

In [8]:
baby_names.Gender.value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [28]:
names = baby_names.groupby('Name').sum().sort_values(by='Count', ascending=False).drop("Year", axis=1).head()

In [30]:
names.Count

Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
Name: Count, dtype: int64

In [10]:
baby_names.Name.value_counts()

Riley       1112
Avery       1080
Jordan      1073
Peyton      1064
Hayden      1049
            ...
Toma           1
Nathanal       1
Garvin         1
Yumalai        1
Marlaina       1
Name: Name, Length: 17632, dtype: int64

(17632, 1)

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

### Step 8. How many different names exist in the dataset?

In [11]:
baby_names.Name.nunique()

17632

17632

### Step 9. What is the name with most occurrences?

In [12]:
baby_names.Name.value_counts()

Riley       1112
Avery       1080
Jordan      1073
Peyton      1064
Hayden      1049
            ...
Toma           1
Nathanal       1
Garvin         1
Yumalai        1
Marlaina       1
Name: Name, Length: 17632, dtype: int64

In [13]:
baby_names.Name.value_counts()  ##waarom Jacob?

Riley       1112
Avery       1080
Jordan      1073
Peyton      1064
Hayden      1049
            ...
Toma           1
Nathanal       1
Garvin         1
Yumalai        1
Marlaina       1
Name: Name, Length: 17632, dtype: int64

'Jacob'

### Step 10. How many different names have the least occurrences?

In [32]:
names.Count.min()

204798

In [15]:
baby_names.Name.nunique()

17632

In [16]:
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

In [17]:
grouped = baby_names.groupby('Name').count()

In [18]:
x = baby_names.groupby('Name').count()["Count"]
x_min = x.min()
x

Name
Aaban        2
Aadan        4
Aadarsh      1
Aaden      196
Aadhav       1
          ...
Zyra         7
Zyrah        2
Zyren        1
Zyria       10
Zyriah       9
Name: Count, Length: 17632, dtype: int64

In [19]:
baby_names.Name.value_counts()

Riley       1112
Avery       1080
Jordan      1073
Peyton      1064
Hayden      1049
            ...
Toma           1
Nathanal       1
Garvin         1
Yumalai        1
Marlaina       1
Name: Name, Length: 17632, dtype: int64

In [20]:
#baby_names.groupby('Name').count().min()

grouped[x == x_min]

            Year  Gender  State  Count
Name
Aadarsh        1       1      1      1
Aadhav         1       1      1      1
Aadin          1       1      1      1
Aahna          1       1      1      1
Aaima          1       1      1      1
...          ...     ...    ...    ...
Zykeriah       1       1      1      1
Zykierra       1       1      1      1
Zymari         1       1      1      1
Zyquavious     1       1      1      1
Zyren          1       1      1      1

[3682 rows x 4 columns]

In [21]:
baby_names.Name.value_counts()[baby_names.Name.value_counts() == baby_names.Name.value_counts().min()]

Kaston      1
Tayzlee     1
Aleli       1
Enna        1
Tayona      1
           ..
Toma        1
Nathanal    1
Garvin      1
Yumalai     1
Marlaina    1
Name: Name, Length: 3682, dtype: int64

2578

### Step 11. What is the median name occurrence?

In [22]:
baby_names.head()   ## Why different.

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [23]:
median_list = baby_names.groupby("Name")["Count"].median()
median_list.median()

6.0

            Count
Name
Aishani        49
Alara          49
Alysse         49
Ameir          49
Anely          49
Antonina       49
Aveline        49
Aziah          49
Baily          49
Caleah         49
Carlota        49
Cristine       49
Dahlila        49
Darvin         49
Deante         49
Deserae        49
Devean         49
Elizah         49
Emmaly         49
Emmanuela      49
Envy           49
Esli           49
Fay            49
Gurshaan       49
Hareem         49
Iven           49
Jaice          49
Jaiyana        49
Jamiracle      49
Jelissa        49
...           ...
Kyndle         49
Kynsley        49
Leylanie       49
Maisha         49
Malillany      49
Mariann        49
Marquell       49
Maurilio       49
Mckynzie       49
Mehdi          49
Nabeel         49
Nalleli        49
Nassir         49
Nazier         49
Nishant        49
Rebecka        49
Reghan         49
Ridwan         49
Riot           49
Rubin          49
Ryatt          49
Sameera        49
Sanjuanita     49
Shalyn         49
Skylie         49
Sriram         49
Trinton        49
Vita           49
Yoni           49
Zuleima        49

[66 rows x 1 columns]

### Step 12. What is the standard deviation of names?

In [24]:
baby_names.iloc[:, :"Name"]

TypeError: cannot do slice indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [Name] of <class 'str'>

In [25]:
baby_names.Name.std()  ### how to do standard deviation of a string?

TypeError: could not convert string to float: 'Emma'

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [26]:
baby_names.describe() ### Why different?

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000

In [27]:
### Vragen stellen nog.